'''Организовать словарь 10 русско- английских слов, обеспечивающий
"перевод" русского слова на английского'''

a = ["монитор","парта", "колонки", "наушники", "девочка", "процессор", "жалюзи", "айтишник", "переводчик", "номер телефона"] # список с русскими словами
b = ["monitor","desk", "columns", "headphones", "girl", "CPU", "blinds", "IT specialist", "interpreter", "phone number"] # список с английскими словами
c = {} # пустой словарь
for i in range(10): # перебор значений
  c[a[i]] = b[i] # присваивание ключу значения
print(c)