'''Определить:
2.в ассортимент магазина ДомКниги добавить автора Лермонтов.'''

magistr = {'Лермонтов','Достоевский','Пушкин','Тютчев'}
domknigi = {'Толстой','Грибоедов','Чехов','Пушкин'}
bukmarket = {'Пушкин','Достоевский','Маяковский'}
galereia = {'Чехов','Пушкин','Тютчев'}
domknigi.add('Лермонтов')  # Добавление в множество domknigi автора Лермонтов
print(domknigi)